Repository: marcominerva/RandomPhotos
Catalog: src/RandomPhotos/Resources/Pages/Index.*.resx
Languages: it

# ApiKeyTooltip
source: The API Key is stored in the client browser only. It is never saved on the server and it is only used to invoke ChatGPT service.
it: L'API Key è salvata nella memoria del browser. Non è mai salvata sul server ed è utilizzata solo per invocare il servizio di ChatGPT.

# ApplicationDescription
source: Translate text using AI
it: Traduci utilzzando l'intelligenza artificiale

source: Close
it: Chiudi

source: Copied!
it: Copiato!

source: Copy to Clipboard
it: Copia negli Appunti

source: Insert API Key...
it: Inserisci l'API Key...

# InsertContextInformation
source: (Optional) Insert context information that can help the translation (for example, "this text is talking about software development", "the text contains legal terms", etc.)...
it: (Opzionale) Inserisci informazioni di contesto che possono aiutare la traduzione (ad esempio, "il testo parla di sviluppo software", "il testo contiene termini legali", ecc.)...

# InsertModelName
source: Insert the model name...
it: Inserisci il nome del modello...

source: Insert Resource name...
it: Inserisci il nome della risorsa...

# InsertText
source: Insert your text here...
it: Inserisci il testo qui...

# InvalidSettingsErrorMessage
source: Use the <a href="#" data-bs-toggle="modal" data-bs-target="#settings">Settings</a> dialog to set the API Key and the other requested configurations for ChatGPT
it: Usa la finestra &lt;a href=&quot;#&quot; data-bs-toggle=&quot;modal&quot; data-bs-target=&quot;#settings&quot;&gt;Impostazioni&lt;/a&gt; per inserire l'API Key e le altre informazioni necessarie alla configurazione di ChatGPT

# ModelNameTooltip
source: The model to use for ChatGPT. If you're using OpenAI, allowed values are: gpt-3.5-turbo, gpt-4 or gpt-4-32k. If you're working with Azure OpenAI service, model name must match the deployment name you have created in the Azure AI Studio.
it: Il modello da utilizzare per ChatGPT. Se si sta utilizzando OpenAI, i valori consentiti sono: gpt-3.5-turbo, gpt-4 or gpt-4-32k. Se si sta utilizzando Azure OpenAI service, il nome del modello deve corrispondere al nome della distruzione che è stata creata nell'Azure AI Studio.

# ResourceNameTooltip
source: The name of the Azure OpenAI Resource that contains the ChatGPT model.
it: Il nome della risorsa di Azure OpenAI Resource che contiene il modello ChatGPT.

# SelectTargetLanguage
source: Select the target language
it: Seleziona la lingua della traduzione

source: Settings
it: Impostazioni
